; domain
(define (domain Ricochet-Robots)
	(:requirements :strips :typing :action-costs :equality)

	(:types 
		robot		; Robot que se desplaza en el tablero
		casilla		; Casilla del tablero
		color		; Colores que tienen los robots, las casillas objetivo y las barreras mágicas
		orientacion
		direccion
		)

	(:constants
		slash backslash - orientacion
		left up right down stop - direccion	; Tanto la adyacencia de las casillas como el movimiento de un robot tiene una dirección
		)

	(:predicates 
		(at ?x - robot ?y - casilla) 				; Un robot está en una casilla
		(colorRobot ?x - robot ?y - color)			; Un robot tiene un color asignado
		(moviendo ?x - robot ?y - direccion)		; Un robot puede moverse, y cuando se detenga, su movimiento será stop
		(movimientoEnCurso ?x - direccion)			; Necesario para controlar que el robot que ha empezado a moverse se mueva 
		(free ?x - casilla)							; No hay robots en la casilla
		(adyacente ?x - casilla ?y - casilla ?z - direccion)	; Dos casillas son adyacentes si existe una dirección que las comunique
		(hasBarrier ?x - casilla)					; Es necesario un predicado para indicar la mera existencia de una barrera en una casilla
		(barraMagica ?x - casilla ?y - color ?z - orientacion)	; Las barreras Mágicas modifican el movimiento de los robots segun los solores y si son / (slash) o \ (backslash)
		(casillaObjetivo ?x - casilla ?y - color)	; Una casilla puede ser casillaObjetivo y debe tener un color asignado
		)

	(:functions
		(total-cost)								; Movimientos realizados, necesitamos ir contando los total-cost realizados
		)


	(:action MoverACasillaLibre	; El robot comienza su movimiento en una dirección válida
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			)
		:precondition (and
			(movimientoEnCurso stop)	; Solo se puede mover un robot cuando no hay movimiento en curso
			(at ?robot ?casillaOrigen)
			(adyacente ?casillaOrigen ?casillaDestino ?direccion)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			(moviendo ?robot ?direccion)
			(not (movimientoEnCurso stop))
			(movimientoEnCurso ?direccion)
			(increase (total-cost) 1)
			)
		)

	(:action LetItGo	; Cuando nada impide el movimiento, el robot se mueve siguiendo la dirección
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(adyacente ?casillaOrigen ?casillaDestino ?direccion)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			(or 
				(not (hasBarrier ?casillaOrigen))
				(or 
					(barraMagica ?casillaOrigen ?color slash)
					(barraMagica ?casillaOrigen ?color backslash)
					)
				)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			)
		)


	(:action StopMiHada	; Cuando un robot o una pared se encuentra en el camino del robot en movimiento, este se para
		:parameters (?robot - robot
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(adyacente ?casillaOrigen ?casillaDestino ?direccion) ; Las paredes se representan como una dirección con la misma casilla origen y destino
			(not (hasBarrier ?casillaOrigen))	; Si la casilla de origen, que es en la que se termina el movimiento, tiene una barrera mágica, el movimiento no se puede terminar
			(or
				(and 		; Hay un robot
					(not (= ?casillaOrigen ?casillaDestino))
					(not (free ?casillaDestino))
					)
				(and 		; Hay una pared
					(= ?casillaOrigen ?casillaDestino)
					)
				)
			)
		:effect	(and
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso stop)
			(not (moviendo ?robot ?direccion))
			)
		)

	(:action ToLeft	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia la izquierda
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por arriba
					(= ?direccion down)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				(and	; El robot llega por abajo
					(= ?direccion up)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino left)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot left)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso left)
			)
		)

	(:action ToHeaven	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia arriba
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por la derecha
					(= ?direccion left)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				(and	; El robot llega por la izquierda
					(= ?direccion right)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino up)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot up)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso up)
			)
		)

	(:action ToRight	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia abajo
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por arriba
					(= ?direccion down)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				(and	; El robot llega por abajo
					(= ?direccion up)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino right)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot right)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso right)
			)
		)

	(:action ToHell	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia abajo
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por la izquierda
					(= ?direccion right)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				(and	; El robot llega por la derecha
					(= ?direccion left)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino down)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot down)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso down)
			)
		)

	)

; problem
(define (problem pRR-5)
    (:domain Ricochet-Robots)

	(:objects
		rojo - color
		robotRojo - robot
		amarillo - color
		verde - color
		robotAmarillo - robot
		A01 - casilla
		A02 - casilla
		A03 - casilla
		A04 - casilla
		B01 - casilla
		B02 - casilla
		B03 - casilla
		B04 - casilla
		C01 - casilla
		C02 - casilla
		C03 - casilla
		C04 - casilla
		D01 - casilla
		D02 - casilla
		D03 - casilla
		D04 - casilla
		)

	(:init
		; Bots
		(colorRobot robotRojo rojo)
		(at robotRojo A01)
		(colorRobot robotAmarillo amarillo)
		(at robotAmarillo D04)
		(movimientoEnCurso stop)
		(= (total-cost) 0)
		; Casillas
		(free A02)
		(free A03)
		(free A04)
		(free B01)
		(free B02)
		(free B03)
		(free B04)
		(free C01)
		(free C02)
		(free C03)
		(free C04)
		(free D01)
		(free D02)
		(free D03)
		; Barras Mágicas
		(hasBarrier A02)
		(barraMagica A02 verde  slash)
		(hasBarrier A03)
		(barraMagica A03 verde  backslash)
		(hasBarrier C03)
		(barraMagica C03 verde  slash)
		(hasBarrier D02)
		(barraMagica D02 verde  backslash)
		; Casillas objetivo
		(casillaObjetivo D04 rojo)
		(casillaObjetivo D01 amarillo)
		; Casillas Adyacentes
		(adyacente A01 A01 left)	; Pared A01 LeftFin
		(adyacente A01 A01 up)		; Pared A01 UpFin
		(adyacente A01 A02 right)
		(adyacente A01 B01 down)
		(adyacente A02 A01 left)
		(adyacente A02 A02 up)		; Pared A02 UpFin
		(adyacente A02 A03 right)
		(adyacente A02 B02 down)
		(adyacente A03 A02 left)
		(adyacente A03 A03 up)		; Pared A03 UpFin
		(adyacente A03 A04 right)
		(adyacente A03 B03 down)
		(adyacente A04 A03 left)
		(adyacente A04 A04 up)		; Pared A04 UpFin
		(adyacente A04 A04 right)	; Pared A04 RightFin
		(adyacente A04 B04 down)
		(adyacente B01 B01 left)	; Pared B01 LeftFin
		(adyacente B01 A01 up)
		(adyacente B01 B01 right)	; Pared B01 - B02
		(adyacente B01 C01 down)
		(adyacente B02 B02 left)	; Pared B02 - B01
		(adyacente B02 A02 up)
		(adyacente B02 B03 right)
		(adyacente B02 C02 down)
		(adyacente B03 B02 left)
		(adyacente B03 A03 up)
		(adyacente B03 B04 right)
		(adyacente B03 C03 down)
		(adyacente B04 B03 left)
		(adyacente B04 A04 up)
		(adyacente B04 B04 right)	; Pared B04 RightFin
		(adyacente B04 C04 down)
		(adyacente C01 C01 left)	; Pared C01 LeftFin
		(adyacente C01 B01 up)
		(adyacente C01 C02 right)
		(adyacente C01 D01 down)
		(adyacente C02 C01 left)
		(adyacente C02 B02 up)
		(adyacente C02 C03 right)
		(adyacente C02 D02 down)
		(adyacente C03 C02 left)
		(adyacente C03 B03 up)
		(adyacente C03 C04 right)
		(adyacente C03 D03 down)
		(adyacente C04 C03 left)
		(adyacente C04 B04 up)
		(adyacente C04 C04 right)	; Pared C04 RightFin
		(adyacente C04 D04 down)
		(adyacente D01 D01 left)	; Pared D01 LeftFin
		(adyacente D01 C01 up)
		(adyacente D01 D02 right)
		(adyacente D01 D01 down)	; Pared D01 DownFin
		(adyacente D02 D01 left)
		(adyacente D02 C02 up)
		(adyacente D02 D03 right)
		(adyacente D02 D02 down)	; Pared D02 DownFin
		(adyacente D03 D02 left)
		(adyacente D03 C03 up)
		(adyacente D03 D04 right)
		(adyacente D03 D03 down)	; Pared D03 DownFin
		(adyacente D04 D03 left)
		(adyacente D04 C04 up)
		(adyacente D04 D04 right)	; Pared D04 RightFin
		(adyacente D04 D04 down)	; Pared D04 DownFin
		)

  (:goal (and
        (at robotRojo D04)
        (at robotAmarillo D01)
        (movimientoEnCurso stop)
        )
    )

    (:metric minimize (total-cost))
)

; plan
1. (moveracasillalibre robotamarillo d04 d03 left)
   deleted: (at robotamarillo d04) (free d03) (movimientoencurso stop)
   added: (free d04) (at robotamarillo d03) (moviendo robotamarillo left) (movimientoencurso left)
   goals met: 0 of 3
2. (letitgo robotamarillo d03 d02 left amarillo)
   deleted: (at robotamarillo d03) (free d02)
   added: (free d03) (at robotamarillo d02)
   goals met: 0 of 3
3. (toheaven robotamarillo d02 c02 left amarillo verde)
   deleted: (at robotamarillo d02) (free c02) (moviendo robotamarillo left) (movimientoencurso left)
   added: (free d02) (at robotamarillo c02) (moviendo robotamarillo up) (movimientoencurso up)
   goals met: 0 of 3
4. (letitgo robotamarillo c02 b02 up amarillo)
   deleted: (at robotamarillo c02) (free b02)
   added: (free c02) (at robotamarillo b02)
   goals met: 0 of 3
5. (letitgo robotamarillo b02 a02 up amarillo)
   deleted: (at robotamarillo b02) (free a02)
   added: (free b02) (at robotamarillo a02)
   goals met: 0 of 3
6. (toright robotamarillo a02 a03 up amarillo verde)
   deleted: (at robotamarillo a02) (free a03) (moviendo robotamarillo up) (movimientoencurso up)
   added: (free a02) (at robotamarillo a03) (moviendo robotamarillo right) (movimientoencurso right)
   goals met: 0 of 3
7. (tohell robotamarillo a03 b03 right amarillo verde)
   deleted: (at robotamarillo a03) (free b03) (moviendo robotamarillo right) (movimientoencurso right)
   added: (free a03) (at robotamarillo b03) (moviendo robotamarillo down) (movimientoencurso down)
   goals met: 0 of 3
8. (letitgo robotamarillo b03 c03 down amarillo)
   deleted: (at robotamarillo b03) (free c03)
   added: (free b03) (at robotamarillo c03)
   goals met: 0 of 3
9. (toleft robotamarillo c03 c02 down amarillo verde)
   deleted: (at robotamarillo c03) (free c02) (moviendo robotamarillo down) (movimientoencurso down)
   added: (free c03) (at robotamarillo c02) (moviendo robotamarillo left) (movimientoencurso left)
   goals met: 0 of 3
10. (letitgo robotamarillo c02 c01 left amarillo)
   deleted: (at robotamarillo c02) (free c01)
   added: (free c02) (at robotamarillo c01)
   goals met: 0 of 3
11. (stopmihada robotamarillo c01 c01 left)
   deleted: (movimientoencurso left) (moviendo robotamarillo left)
   added: (movimientoencurso stop)
   goals met: 1 of 3
12. (moveracasillalibre robotamarillo c01 d01 down)
   deleted: (at robotamarillo c01) (free d01) (movimientoencurso stop)
   added: (free c01) (at robotamarillo d01) (moviendo robotamarillo down) (movimientoencurso down)
   goals met: 1 of 3
13. (stopmihada robotamarillo d01 d01 down)
   deleted: (movimientoencurso down) (moviendo robotamarillo down)
   added: (movimientoencurso stop)
   goals met: 2 of 3
14. (moveracasillalibre robotrojo a01 b01 down)
   deleted: (at robotrojo a01) (free b01) (movimientoencurso stop)
   added: (free a01) (at robotrojo b01) (moviendo robotrojo down) (movimientoencurso down)
   goals met: 1 of 3
15. (letitgo robotrojo b01 c01 down rojo)
   deleted: (at robotrojo b01) (free c01)
   added: (free b01) (at robotrojo c01)
   goals met: 1 of 3
16. (stopmihada robotrojo c01 d01 down)
   deleted: (movimientoencurso down) (moviendo robotrojo down)
   added: (movimientoencurso stop)
   goals met: 2 of 3
17. (moveracasillalibre robotrojo c01 c02 right)
   deleted: (at robotrojo c01) (free c02) (movimientoencurso stop)
   added: (free c01) (at robotrojo c02) (moviendo robotrojo right) (movimientoencurso right)
   goals met: 1 of 3
18. (letitgo robotrojo c02 c03 right rojo)
   deleted: (at robotrojo c02) (free c03)
   added: (free c02) (at robotrojo c03)
   goals met: 1 of 3
19. (toheaven robotrojo c03 b03 right rojo verde)
   deleted: (at robotrojo c03) (free b03) (moviendo robotrojo right) (movimientoencurso right)
   added: (free c03) (at robotrojo b03) (moviendo robotrojo up) (movimientoencurso up)
   goals met: 1 of 3
20. (letitgo robotrojo b03 a03 up rojo)
   deleted: (at robotrojo b03) (free a03)
   added: (free b03) (at robotrojo a03)
   goals met: 1 of 3
21. (toleft robotrojo a03 a02 up rojo verde)
   deleted: (at robotrojo a03) (free a02) (moviendo robotrojo up) (movimientoencurso up)
   added: (free a03) (at robotrojo a02) (moviendo robotrojo left) (movimientoencurso left)
   goals met: 1 of 3
22. (tohell robotrojo a02 b02 left rojo verde)
   deleted: (at robotrojo a02) (free b02) (moviendo robotrojo left) (movimientoencurso left)
   added: (free a02) (at robotrojo b02) (moviendo robotrojo down) (movimientoencurso down)
   goals met: 1 of 3
23. (letitgo robotrojo b02 c02 down rojo)
   deleted: (at robotrojo b02) (free c02)
   added: (free b02) (at robotrojo c02)
   goals met: 1 of 3
24. (letitgo robotrojo c02 d02 down rojo)
   deleted: (at robotrojo c02) (free d02)
   added: (free c02) (at robotrojo d02)
   goals met: 1 of 3
25. (toright robotrojo d02 d03 down rojo verde)
   deleted: (at robotrojo d02) (free d03) (moviendo robotrojo down) (movimientoencurso down)
   added: (free d02) (at robotrojo d03) (moviendo robotrojo right) (movimientoencurso right)
   goals met: 1 of 3
26. (letitgo robotrojo d03 d04 right rojo)
   deleted: (at robotrojo d03) (free d04)
   added: (free d03) (at robotrojo d04)
   goals met: 2 of 3
27. (stopmihada robotrojo d04 d04 right)
   deleted: (movimientoencurso right) (moviendo robotrojo right)
   added: (movimientoencurso stop)
   goals met: 3 of 3
